Repository: exodus-ai-org/ios
Catalog: Resources/App/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, ja, ko, pt_br, zh_hant, zh_hk

# settings:secrets.input.savedShortAria
source: Saved key
de: Gespeicherter Schlüssel
es: Clave guardada
fr: Clé enregistrée
it: Chiave salvata
ja: 保存済みキー
ko: 저장된 키
pt_br: Chave salva
zh_hant: 已儲存的金鑰
zh_hk: 已儲存的金鑰

# settings:secrets.notice.needsReentry
source: Enter these keys again — they can't be read any more, or were cleared when their address changed:
de: Geben Sie diese Schlüssel erneut ein – sie können nicht mehr gelesen werden oder wurden beim Ändern ihrer Adresse gelöscht:
es: Vuelva a introducir estas claves: ya no se pueden leer o se borraron al cambiar su dirección:
fr: Saisissez à nouveau ces clés : elles ne peuvent plus être lues ou ont été effacées lors du changement de leur adresse :
it: Inserisci di nuovo queste chiavi: non possono più essere lette o sono state cancellate quando è cambiato il loro indirizzo:
ja: 次のキーをもう一度入力してください。読み取れなくなったか、アドレスの変更時に消去されました:
ko: 다음 키를 다시 입력해 주세요. 더 이상 읽을 수 없거나 주소가 변경되어 지워졌습니다:
pt_br: Digite estas chaves novamente — elas não podem mais ser lidas ou foram apagadas quando o endereço mudou:
zh_hant: 請重新輸入以下金鑰：它們已無法讀取，或在變更位址時已被清除：
zh_hk: 請重新輸入以下金鑰：它們已無法讀取，或在更改位址時已被清除：

# settings:skillsMarket.installedTab.empty
source: No skills installed yet
de: Noch keine Skills installiert
es: Aún no hay skills instalados
fr: Aucun skill installé pour l’instant
it: Nessuna skill installata
ja: インストール済みのスキルはまだありません
ko: 아직 설치된 스킬이 없습니다
pt_br: Nenhuma skill instalada ainda
zh_hant: 尚未安裝任何技能
zh_hk: 尚未安裝任何技能

# settings:skillsMarket.installedTab.installedAt
source: Installed %@
de: Installiert %@
es: Instalado %@
fr: Installé %@
it: Installata %@
ja: %@ にインストール
ko: %@ 설치
pt_br: Instalada em %@
zh_hant: 安裝於 %@
zh_hk: 安裝於 %@

# settings:skillsMarket.installedTab.legacy
source: Legacy
de: Alt
es: Antiguo
fr: Ancien
ja: 旧形式
ko: 레거시
pt_br: Legado
zh_hant: 舊版
zh_hk: 舊版

# settings:skillsMarket.toast.updateFailed
source: Couldn’t update the skill
de: Der Skill konnte nicht aktualisiert werden
es: No se pudo actualizar el skill
fr: Impossible de mettre à jour le skill
it: Impossibile aggiornare la skill
ja: スキルを更新できませんでした
ko: 스킬을 업데이트할 수 없습니다
pt_br: Não foi possível atualizar a skill
zh_hant: 無法更新技能
zh_hk: 無法更新技能

# settings:tools.groups.aiData
source: AI & Data
de: KI & Daten
es: IA y datos
fr: IA et données
it: AI e dati
ja: AIとデータ
ko: AI 및 데이터
pt_br: IA e Dados
zh_hant: AI 與資料
zh_hk: AI 與資料

# settings:tools.groups.fileSystem
source: File System
de: Dateisystem
es: Sistema de archivos
fr: Système de fichiers
ja: ファイルシステム
ko: 파일 시스템
pt_br: Sistema de Arquivos
zh_hant: 檔案系統
zh_hk: 檔案系統

# settings:tools.groups.maps
source: Maps
de: Karten
es: Mapas
fr: Cartes
it: Mappe
ja: マップ
ko: 지도
pt_br: Mapas
zh_hant: 地圖
zh_hk: 地圖

# settings:tools.registry.editFile.description
source: Targeted string replacement in existing files
de: Gezielter Textersatz in bestehenden Dateien
es: Reemplazo de texto específico en archivos existentes
fr: Remplacement ciblé de texte dans des fichiers existants
it: Sostituzione mirata di stringhe nei file esistenti
ja: 既存ファイルに対する対象を絞った文字列の置換
ko: 기존 파일에서 특정 문자열을 대상으로 교체합니다
pt_br: Substituição direcionada de texto em arquivos existentes
zh_hant: 在現有檔案中進行指定的字串取代
zh_hk: 在現有檔案中進行指定的字串取代

# settings:tools.registry.editFile.label
source: Edit File
de: Datei bearbeiten
es: Editar archivo
fr: Modifier un fichier
it: Modifica file
ja: ファイル編集
ko: 파일 편집
pt_br: Editar Arquivo
zh_hant: 編輯檔案
zh_hk: 編輯檔案

# settings:tools.registry.findFiles.description
source: Search for files by glob pattern
de: Dateien anhand eines Glob-Musters suchen
es: Buscar archivos por patrón glob
fr: Rechercher des fichiers par motif glob
it: Cerca file tramite pattern glob
ja: globパターンでファイルを検索します
ko: 글롭 패턴으로 파일을 검색합니다
pt_br: Pesquisar arquivos por padrão glob
zh_hant: 依 glob 模式搜尋檔案
zh_hk: 依 glob 模式搜尋檔案

# settings:tools.registry.findFiles.label
source: Find Files
de: Dateien suchen
es: Buscar archivos
fr: Rechercher des fichiers
it: Trova file
ja: ファイル検索
ko: 파일 찾기
pt_br: Localizar Arquivos
zh_hant: 尋找檔案
zh_hk: 尋找檔案

# settings:tools.registry.grep.description
source: Search file contents by regex pattern
de: Dateiinhalte anhand eines regulären Ausdrucks durchsuchen
es: Buscar en el contenido de archivos por patrón de expresión regular
fr: Rechercher dans le contenu des fichiers par expression régulière
it: Cerca il contenuto dei file tramite pattern regex
ja: 正規表現パターンでファイルの内容を検索します
ko: 정규식 패턴으로 파일 내용을 검색합니다
pt_br: Pesquisar o conteúdo de arquivos por padrão de expressão regular
zh_hant: 依正規表示式搜尋檔案內容
zh_hk: 依正規表示式搜尋檔案內容

# settings:tools.registry.imageGeneration.description
source: Generate images via DALL-E (requires OpenAI API key)
de: Bilder über DALL-E generieren (OpenAI-API-Schlüssel erforderlich)
es: Generar imágenes mediante DALL-E (requiere clave de API de OpenAI)
fr: Générer des images via DALL-E (nécessite une clé API OpenAI)
it: Genera immagini tramite DALL-E (richiede una chiave API OpenAI)
ja: DALL-E経由で画像を生成します(OpenAI APIキーが必要です)
ko: DALL-E로 이미지를 생성합니다 (OpenAI API 키 필요)
pt_br: Gerar imagens via DALL-E (requer chave de API da OpenAI)
zh_hant: 透過 DALL-E 生成圖片（需要 OpenAI API 金鑰）
zh_hk: 透過 DALL-E 生成圖片（需要 OpenAI API 金鑰）

# settings:tools.registry.imageGeneration.label
source: Image Generation
de: Bildgenerierung
es: Generación de imágenes
fr: Génération d'images
it: Generazione immagini
ja: 画像生成
ko: 이미지 생성
pt_br: Geração de Imagens
zh_hant: 圖片生成
zh_hk: 圖片生成

# settings:tools.registry.listDirectory.description
source: List files and folders in a directory
de: Dateien und Ordner in einem Verzeichnis auflisten
es: Listar archivos y carpetas de un directorio
fr: Lister les fichiers et dossiers d'un répertoire
it: Elenca file e cartelle in una directory
ja: ディレクトリ内のファイルとフォルダを一覧表示します
ko: 디렉터리 내 파일과 폴더 목록을 표시합니다
pt_br: Listar arquivos e pastas em um diretório
zh_hant: 列出目錄中的檔案與資料夾
zh_hk: 列出目錄中的檔案與資料夾

# settings:tools.registry.listDirectory.label
source: List Directory
de: Verzeichnis auflisten
es: Listar directorio
fr: Lister un dossier
it: Elenca directory
ja: ディレクトリ一覧
ko: 디렉터리 목록
pt_br: Listar Diretório
zh_hant: 列出目錄
zh_hk: 列出目錄

# settings:tools.registry.mapItinerary.description
source: Render places, routes, and multi-day trips on a single interactive map card
de: Orte, Routen und mehrtägige Reisen auf einer interaktiven Kartenkarte darstellen
es: Mostrar lugares, rutas y viajes de varios días en una sola tarjeta de mapa interactiva
fr: Afficher des lieux, itinéraires et voyages multi-jours sur une carte interactive unique
it: Visualizza luoghi, percorsi e viaggi di più giorni in un'unica scheda mappa interattiva
ja: スポット、ルート、複数日の旅程を1枚のインタラクティブなマップカードに表示します
ko: 장소, 경로, 여러 날에 걸친 여행을 하나의 인터랙티브 지도 카드에 표시합니다
pt_br: Renderizar locais, rotas e viagens de vários dias em um único cartão de mapa interativo
zh_hant: 在單一互動式地圖卡片上顯示地點、路線與多日行程
zh_hk: 在單一互動式地圖卡片上顯示地點、路線與多日行程

# settings:tools.registry.mapItinerary.label
source: Map Itinerary
de: Reiseroute
es: Itinerario en mapa
fr: Itinéraire cartographique
it: Itinerario mappa
ja: 旅程マップ
ko: 지도 일정
pt_br: Itinerário no Mapa
zh_hant: 地圖行程
zh_hk: 地圖行程

# settings:tools.registry.readFile.description
source: Read file contents by path
de: Dateiinhalte anhand des Pfads lesen
es: Leer el contenido de un archivo por ruta
fr: Lire le contenu d'un fichier à partir de son chemin
it: Leggi il contenuto di un file tramite il percorso
ja: パスを指定してファイルの内容を読み取ります
ko: 경로로 파일 내용을 읽습니다
pt_br: Ler o conteúdo de um arquivo pelo caminho
zh_hant: 依路徑讀取檔案內容
zh_hk: 依路徑讀取檔案內容

# settings:tools.registry.readFile.label
source: Read File
de: Datei lesen
es: Leer archivo
fr: Lire un fichier
it: Leggi file
ja: ファイル読み取り
ko: 파일 읽기
pt_br: Ler Arquivo
zh_hant: 讀取檔案
zh_hk: 讀取檔案

# settings:tools.registry.searchKnowledgeBase.description
source: Retrieve context from your knowledge base (requires a configured LightRAG URL)
de: Kontext aus Ihrer Wissensdatenbank abrufen (erfordert eine konfigurierte LightRAG-URL)
es: Recuperar contexto de su base de conocimientos (requiere una URL de LightRAG configurada)
fr: Récupérer du contexte depuis votre base de connaissances (nécessite une URL LightRAG configurée)
it: Recupera contesto dalla tua knowledge base (richiede un URL LightRAG configurato)
ja: ナレッジベースからコンテキストを取得します(LightRAGのURLの設定が必要です)
ko: 지식 베이스에서 컨텍스트를 가져옵니다 (LightRAG URL 구성 필요)
pt_br: Recuperar contexto da sua base de conhecimento (requer uma URL do LightRAG configurada)
zh_hant: 從你的知識庫擷取內容（需要設定 LightRAG URL）
zh_hk: 從你的知識庫擷取內容（需要設定 LightRAG URL）

# settings:tools.registry.searchKnowledgeBase.label
source: Knowledge Base
de: Wissensdatenbank
es: Base de conocimientos
fr: Base de connaissances
ja: ナレッジベース
ko: 지식 베이스
pt_br: Base de Conhecimento
zh_hant: 知識庫
zh_hk: 知識庫

# settings:tools.registry.terminal.description
source: Execute shell commands on your machine
de: Shell-Befehle auf Ihrem Rechner ausführen
es: Ejecutar comandos de shell en su equipo
fr: Exécuter des commandes shell sur votre machine
it: Esegui comandi shell sul tuo computer
ja: お使いのマシンでシェルコマンドを実行します
ko: 내 컴퓨터에서 셸 명령을 실행합니다
pt_br: Executar comandos de shell na sua máquina
zh_hant: 在你的電腦上執行 shell 指令
zh_hk: 在你的電腦上執行 shell 指令

# settings:tools.registry.updateMemory.description
source: Lets the assistant correct, add or remove memories when you tell it something about you is wrong.
de: Erlaubt dem Assistenten, Gedächtniseinträge zu korrigieren, hinzuzufügen oder zu entfernen, wenn Sie ihm sagen, dass etwas über Sie nicht stimmt.
es: Permite que el asistente corrija, agregue o elimine entradas de memoria cuando le diga que algo sobre usted es incorrecto.
fr: Permet à l'assistant de corriger, d'ajouter ou de supprimer des mémoires lorsque vous lui indiquez qu'une information à votre sujet est inexacte.
it: Consente all'assistente di correggere, aggiungere o rimuovere voci di memoria quando gli dici che qualcosa su di te è sbagliato.
ja: あなたについての情報が間違っていると伝えると、アシスタントがメモリーを訂正・追加・削除できるようになります。
ko: 당신에 대해 잘못 알고 있는 점을 알려주면 어시스턴트가 메모리를 수정, 추가 또는 삭제할 수 있습니다.
pt_br: Permite que o assistente corrija, adicione ou remova memórias quando você disser que algo sobre você está errado.
zh_hant: 當你告訴助理你的某些資訊有誤時，助理可以修正、新增或刪除記憶。
zh_hk: 當你告訴助理你的某些資訊有誤時，助理可以修正、新增或刪除記憶。

# settings:tools.registry.updateMemory.label
source: Update Memory
de: Gedächtnis aktualisieren
es: Actualizar memoria
fr: Mettre à jour la mémoire
it: Aggiorna memoria
ja: メモリーを更新
ko: 메모리 업데이트
pt_br: Atualizar Memória
zh_hant: 更新記憶
zh_hk: 更新記憶

# settings:tools.registry.weather.description
source: Look up current weather and forecasts by location
de: Aktuelles Wetter und Vorhersagen nach Standort abrufen
es: Consultar el clima actual y los pronósticos por ubicación
fr: Consulter la météo actuelle et les prévisions par lieu
it: Consulta il meteo attuale e le previsioni per una località
ja: 場所ごとの現在の天気と予報を調べます
ko: 위치별 현재 날씨와 예보를 조회합니다
pt_br: Consultar o clima atual e previsões por localização
zh_hant: 依地點查詢目前天氣與預報
zh_hk: 依地點查詢目前天氣與預報

# settings:tools.registry.weather.label
source: Weather
de: Wetter
es: Clima
fr: Météo
it: Meteo
ja: 天気
ko: 날씨
pt_br: Clima
zh_hant: 天氣
zh_hk: 天氣

# settings:tools.registry.webFetch.description
source: Fetch the content of a URL (docs, APIs, GitHub files)
de: Den Inhalt einer URL abrufen (Dokumentation, APIs, GitHub-Dateien)
es: Obtener el contenido de una URL (documentación, APIs, archivos de GitHub)
fr: Récupérer le contenu d'une URL (documentation, API, fichiers GitHub)
it: Recupera il contenuto di un URL (documentazione, API, file GitHub)
ja: URLのコンテンツを取得します(ドキュメント、API、GitHubファイルなど)
ko: URL의 콘텐츠를 가져옵니다 (문서, API, GitHub 파일)
pt_br: Buscar o conteúdo de uma URL (documentação, APIs, arquivos do GitHub)
zh_hant: 擷取 URL 的內容（文件、API、GitHub 檔案）
zh_hk: 擷取 URL 的內容（文件、API、GitHub 檔案）

# settings:tools.registry.webFetch.label
source: Web Fetch
de: Web-Abruf
es: Obtener página web
fr: Récupération Web
it: Recupero web
ja: ウェブ取得
ko: 웹 가져오기
pt_br: Buscar Página Web
zh_hant: 網頁擷取
zh_hk: 網頁擷取

# settings:tools.registry.webSearch.description
source: Search the web via Brave Search API (requires API key)
de: Das Web über die Brave Search API durchsuchen (API-Schlüssel erforderlich)
es: Buscar en la web mediante la API de Brave Search (requiere clave de API)
fr: Rechercher sur le web via l'API Brave Search (nécessite une clé API)
it: Cerca sul web tramite l'API di Brave Search (richiede una chiave API)
ja: Brave Search API経由でウェブを検索します(APIキーが必要です)
ko: Brave Search API로 웹을 검색합니다 (API 키 필요)
pt_br: Pesquisar na web via API do Brave Search (requer chave de API)
zh_hant: 透過 Brave Search API 搜尋網路（需要 API 金鑰）
zh_hk: 透過 Brave Search API 搜尋網絡（需要 API 金鑰）

# settings:tools.registry.webSearch.label
source: Web Search
de: Websuche
es: Búsqueda web
fr: Recherche Web
it: Ricerca web
ja: ウェブ検索
ko: 웹 검색
pt_br: Pesquisa na Web
zh_hant: 網路搜尋
zh_hk: 網絡搜尋

# settings:tools.registry.writeFile.description
source: Create or overwrite files
de: Dateien erstellen oder überschreiben
es: Crear o sobrescribir archivos
fr: Créer ou remplacer des fichiers
it: Crea o sovrascrivi file
ja: ファイルを新規作成または上書きします
ko: 파일을 생성하거나 덮어씁니다
pt_br: Criar ou sobrescrever arquivos
zh_hant: 建立或覆寫檔案
zh_hk: 建立或覆寫檔案

# settings:tools.registry.writeFile.label
source: Write File
de: Datei schreiben
es: Escribir archivo
fr: Écrire un fichier
it: Scrivi file
ja: ファイル書き込み
ko: 파일 쓰기
pt_br: Gravar Arquivo
zh_hant: 寫入檔案
zh_hk: 寫入檔案

# webSearch:imageLightbox.imageUnavailable
source: Image unavailable
de: Bild nicht verfügbar
es: Imagen no disponible
fr: Image indisponible
it: Immagine non disponibile
ja: 画像を利用できません
ko: 이미지를 사용할 수 없습니다
pt_br: Imagem indisponível
zh_hant: 圖片無法使用
zh_hk: 圖片無法使用

# webSearch:imageLightbox.previewOnly
source: Showing preview — full image unavailable
de: Vorschau wird angezeigt — vollständiges Bild nicht verfügbar
es: Mostrando vista previa: la imagen completa no está disponible
fr: Aperçu affiché — image complète indisponible
it: Anteprima mostrata — immagine completa non disponibile
ja: プレビューを表示しています — 完全な画像は利用できません
ko: 미리보기만 표시 — 원본 이미지를 사용할 수 없습니다
pt_br: Mostrando pré-visualização — imagem completa indisponível
zh_hant: 僅顯示預覽——完整圖片無法使用
zh_hk: 只顯示預覽——完整圖片無法使用

# webSearch:videoCard.views
source: %@ views
de: %@ Aufrufe
es: %@ vistas
fr: %@ vues
it: %@ visualizzazioni
ja: %@回視聴
ko: 조회수 %@회
pt_br: %@ visualizações
zh_hant: %@ 次觀看
zh_hk: %@ 次觀看

# chat:computerUseCard.title
source: Computer Use
es: Uso del equipo
fr: Utilisation de l'ordinateur
pt_br: Uso do Computador
zh_hant: 電腦操作
zh_hk: 電腦操作

# chat:weatherCard.details
source: Details
es: Detalles
fr: Détails
it: Dettagli
ja: 詳細
ko: 상세
pt_br: Detalhes
zh_hant: 詳細
zh_hk: 詳情

# chat:weatherCard.uvIndex
source: UV Index
es: Índice UV
fr: Indice UV
it: Indice UV
ja: UV指数
ko: 자외선 지수
pt_br: Índice UV
zh_hant: 紫外線指數
zh_hk: 紫外線指數

# chat:weatherCard.wind
source: Wind
es: Viento
fr: Vent
it: Vento
ja: 風
ko: 바람
pt_br: Vento
zh_hant: 風
zh_hk: 風

# ios:chat.card.media.video
source: Video: %@
es: Vídeo: %@
fr: Vidéo : %@
ja: 動画: %@
ko: 동영상: %@
pt_br: Vídeo: %@
zh_hant: 影片：%@
zh_hk: 影片：%@

# ios:chat.message.tool.fallback
source: Tool
es: Herramienta
fr: Outil
it: Strumento
ja: ツール
ko: 도구
pt_br: Ferramenta
zh_hant: 工具
zh_hk: 工具

# ios:settings.hub.group.computer
source: Computer
es: Ordenador
fr: Ordinateur
ja: コンピュータ
ko: 컴퓨터
pt_br: Computador
zh_hant: 電腦
zh_hk: 電腦

# ios:settings.mcp.toolCount
source: Tools: %lld
es: Herramientas: %lld
fr: Outils : %lld
it: Strumenti: %lld
ja: ツール: %lld
ko: 도구: %lld
pt_br: Ferramentas: %lld
zh_hant: 工具：%lld
zh_hk: 工具：%lld

# ios:settings.pairing.sectionTitle
source: Computer
es: Ordenador
fr: Ordinateur
ja: コンピュータ
ko: 컴퓨터
pt_br: Computador
zh_hant: 電腦
zh_hk: 電腦

# settings:dataControls.sections.backups
source: Backups
es: Copias de seguridad
fr: Sauvegardes
it: Backup
ja: バックアップ
ko: 백업
zh_hant: 備份
zh_hk: 備份

# settings:general.colorTone.tones.neutral
source: Neutral
es: Neutro
fr: Neutre
it: Neutro
ja: ニュートラル
ko: 중립
pt_br: Neutro
zh_hant: 中性
zh_hk: 中性

# settings:general.colorTone.tones.orange
source: Orange
es: Naranja
it: Arancione
ja: オレンジ
ko: 오렌지
pt_br: Laranja
zh_hant: 橙色
zh_hk: 橙色

# settings:memory.detail.detailsLabel
source: Details
es: Detalles
fr: Détails
it: Dettagli
ja: 詳細
ko: 세부 내용
pt_br: Detalhes
zh_hant: 詳細內容
zh_hk: 詳細內容

# settings:personality.emoji
source: Emoji
es: Emojis
fr: Émojis
ja: 絵文字
ko: 이모지
zh_hant: 表情符號
zh_hk: 表情符號

# settings:providers.azure.apiVersion.label
source: API Version
es: Versión de la API
fr: Version de l'API
it: Versione API
ja: APIバージョン
ko: API 버전
pt_br: Versão da API
zh_hant: API 版本
zh_hk: API 版本

# settings:secrets.fields.mcp
source: MCP server “%@”: %@
es: Servidor MCP «%@»: %@
fr: Serveur MCP « %@ » : %@
it: Server MCP «%@»: %@
ja: MCP サーバー「%@」: %@
ko: MCP 서버 “%@”: %@
pt_br: Servidor MCP “%@”: %@
zh_hant: MCP 伺服器「%@」：%@
zh_hk: MCP 伺服器「%@」：%@

# ios:app.workspace.health
source: Health
es: Salud
fr: Santé
it: Salute
ja: ヘルスケア
ko: 건강
pt_br: Saúde
zh_hant: 健康
zh_hk: 健康

# chat:toast.chatFallbackTitle
source: Chat
fr: Conversation
ja: チャット
ko: 채팅
zh_hant: 聊天
zh_hk: 聊天

# ios:app.workspace.chat
source: Chat
fr: Conversation
ja: チャット
ko: 채팅
zh_hant: 聊天
zh_hk: 聊天

# ios:settings.profile.chartTokens
source: Tokens
fr: Jetons
it: Token
ja: トークン
ko: 토큰
zh_hant: Token
zh_hk: Token

# ios:chat.message.tool.terminal
source: Terminal
it: Terminale
ja: ターミナル
ko: 터미널
zh_hant: 終端機
zh_hk: 終端機

# settings:tools.registry.terminal.label
source: Terminal
it: Terminale
ja: ターミナル
ko: 터미널
zh_hant: 終端機
zh_hk: 終端機

# ios:health.unit.breathsPerMin
source: %@ /min
ja: %@ 回/分
ko: 분당 %@회
zh_hant: %@ 次/分
zh_hk: %@ 次/分鐘

# settings:tools.groups.web
source: Web
ja: ウェブ
ko: 웹
zh_hant: 網路
zh_hk: 網絡

# ios:app.alert.ok
source: OK
ko: 확인
zh_hant: 確定
zh_hk: 確定
